; domain
(define (domain Dungeon)

    (:requirements :typing :negative-preconditions :universal-preconditions :disjunctive-preconditions)

    (:types
        room hero turn
    )

    (:predicates
        ; Define the locations of objects
        (at-hero ?h - hero ?r - room)
        (at-monster ?r - room)
        (at-sword ?r - room)
        (at-key ?r - room)
        (at-lock ?r - room)
        (at-trap ?r - room)
        (connected ?r1 ?r2 - room)

        ; Define room statuses
        (is-destroyed ?r - room)
        (is-disarmed ?r - room)

        ; Define hero statuses
        (holding-nothing ?h - hero)
        (holding-sword ?h - hero)
        (holding-key ?h - hero)

        ; Define heroes' goals
        (has-goal ?h - hero ?r - room)
        (has-escaped ?h - hero)

        ; Define turns
        (hero-turn ?h - hero ?t - turn)
        (current-turn ?t - turn)
        (next-turn ?t1 ?t2 - turn)
    )

    ; Move to an adjacent room where there is no monster, no trap, and no lock
    (:action move
        :parameters (?from ?to - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?from)
            (connected ?from ?to)
            (not (is-destroyed ?to))
            (not (at-monster ?to))
            (not (at-trap ?to))
            (not (at-lock ?to))
            (or
                (not (at-trap ?from))
                (is-disarmed ?from)
            )

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?h))
        )
        :effect (and
            (when
                (has-goal ?h ?to)
                (has-escaped ?h)
            )

            (at-hero ?h ?to)
            (not (at-hero ?h ?from))
            (is-destroyed ?from)

            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Move to an adjacent room where there is a trap if he is holding nothing
    (:action move-trap
        :parameters (?from ?to - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?from)
            (connected ?from ?to)
            (not (is-destroyed ?to))
            (not (at-monster ?to))
            (at-trap ?to) (holding-nothing ?h)
            (not (at-lock ?to))
            (or
                (not (at-trap ?from))
                (is-disarmed ?from)
            )

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?h))
        )
        :effect (and
            (at-hero ?h ?to)
            (not (at-hero ?h ?from))
            (is-destroyed ?from)
            ; (is-disarmed ?r)

            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Move to an adjacent room where there is a monster if he is holding a sword
    (:action move-monster
        :parameters (?from ?to - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?from)
            (connected ?from ?to)
            (not (is-destroyed ?to))
            (at-monster ?to) (holding-sword ?h)
            (not (at-trap ?to))
            (not (at-lock ?to))
            (or
                (not (at-trap ?from))
                (is-disarmed ?from)
            )

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?h))
        )
        :effect (and
            (at-hero ?h ?to)
            (not (at-hero ?h ?from))
            (is-destroyed ?from)

            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Move to an adjacent room where there is a lock if he is holding a key
    (:action move-lock
        :parameters (?from ?to - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?from)
            (connected ?from ?to)
            (not (is-destroyed ?to))
            (not (at-monster ?to))
            (not (at-trap ?to))
            (at-lock ?to) (holding-key ?h)
            (or
                (not (at-trap ?from))
                (is-disarmed ?from)
            )

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?h))
        )
        :effect (and
            (at-hero ?h ?to)
            (not (at-hero ?h ?from))
            (is-destroyed ?from)

            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Pick up a sword if he is holding nothing
    (:action pick-up-sword
        :parameters (?r - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?r)
            (at-sword ?r)
            (holding-nothing ?h)

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?h))
        )
        :effect (and
            (holding-sword ?h)
            (not (holding-nothing ?h))
            (not (at-sword ?r))

            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Pick up a key if he is holding nothing
    (:action pick-up-key
        :parameters (?r - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?r)
            (at-key ?r)
            (holding-nothing ?h)

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?h))
        )
        :effect (and
            (holding-key ?h)
            (not (holding-nothing ?h))
            (not (at-key ?r))

            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Drop a sword if he is holding one and not in a room with a monster/trap
    (:action drop-sword
        :parameters (?r - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?r)
            (holding-sword ?h)
            (not (at-monster ?r))
            (not (at-trap ?r))
            (not (at-lock ?r))

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?h))
        )
        :effect (and
            (holding-nothing ?h)
            (not (holding-sword ?h))
            (at-sword ?r)

            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Drop a key if he is holding a key and not in a room with a lock
    (:action drop-key
        :parameters (?r - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?r)
            (holding-key ?h)
            (not (at-monster ?r))
            (not (at-trap ?r))
            (not (at-lock ?r))

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?h))
        )
        :effect (and
            (holding-nothing ?h)
            (not (holding-key ?h))
            (at-key ?r)

            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Disarm a trap if he is holding nothing
    (:action disarm-trap
        :parameters (?r - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?r)
            (holding-nothing ?h)
            (not (at-monster ?r))
            (at-trap ?r)
            (not (at-lock ?r))

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?h))
        )
        :effect (and
            (is-disarmed ?r)

            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Pass a sword to another hero
    (:action pass-sword
        :parameters (?r - room ?giver ?receiver - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?giver ?r)
            (holding-sword ?giver)
            (at-hero ?receiver ?r)
            (holding-nothing ?receiver)
            (not (= ?giver ?receiver))

            (hero-turn ?giver ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?giver))
        )
        :effect (and
            (holding-nothing ?giver)
            (not (holding-sword ?giver))
            (holding-sword ?receiver)

            (hero-turn ?giver ?next)
            (not (hero-turn ?giver ?curr))
        )
    )

    ; Pass a key to another hero
    (:action pass-key
        :parameters (?r - room ?giver ?receiver - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?giver ?r)
            (holding-key ?giver)
            (at-hero ?receiver ?r)
            (holding-nothing ?receiver)
            (not (= ?giver ?receiver))

            (hero-turn ?giver ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
            (not (has-escaped ?giver))
        )
        :effect (and
            (holding-nothing ?giver)
            (not (holding-key ?giver))
            (holding-key ?receiver)

            (hero-turn ?giver ?next)
            (not (hero-turn ?giver ?curr))
        )
    )

    (:action do-nothing
        :parameters (?r - room ?h - hero ?curr ?next - turn)
        :precondition (and
            (at-hero ?h ?r)
            (has-escaped ?h)

            (hero-turn ?h ?curr)
            (current-turn ?curr)
            (next-turn ?curr ?next)
        )
        :effect (and
            (hero-turn ?h ?next)
            (not (hero-turn ?h ?curr))
        )
    )

    ; Advance a turn
    (:action advance-turn
        :parameters (?curr ?next - turn)
        :precondition (and
            (forall
                (?h - hero)
                (or
                    (hero-turn ?h ?next)
                    (has-escaped ?h)
                )
            )

            (current-turn ?curr)
            (next-turn ?curr ?next)
        )
        :effect (and
            (not (current-turn ?curr))
            (current-turn ?next)
        )
    )

)

; problem
(define (problem problem1)

    (:domain Dungeon)
    (:objects
        roomA1 roomA2 roomA3 roomA4 roomA5 roomA6 roomA7 roomA8 roomB1 roomB2 roomB3 roomB4 roomB5 roomB6 roomB7 roomB8 roomC1 roomC2 roomC3 roomC4 roomC5 roomC6 roomC7 roomC8 roomD1 roomD2 roomD3 roomD4 roomD5 roomD6 roomD7 roomD8 - room
        hero1 hero2 - hero
        curr next - turn
    )
    (:init
        ; Define the initial hero statuses
        (at-hero hero1 roomD4)
        (at-hero hero2 roomB8)
        (holding-nothing hero1)
        (holding-nothing hero2)

        ; Define turns
        (current-turn curr)
        (hero-turn hero1 curr)
        (hero-turn hero2 curr)
        ; Define relations between turns
        (next-turn curr next)
        (next-turn next curr)

        ; Define special rooms
        (at-monster roomA3)
        (at-monster roomB2)
        (at-monster roomB6)
        (at-monster roomC3)
        (at-monster roomD1)
        (at-monster roomD8)
        (at-sword roomA8)
        (at-sword roomB4)
        (at-sword roomD2)
        (at-lock roomA4)
        (at-lock roomA7)
        (at-lock roomC5)
        (at-lock roomD5)
        (at-key roomC7)
        (at-trap roomB1)
        (at-trap roomD3)

        ; Define room connections
        (connected roomA1 roomA2)
        (connected roomA2 roomA3)
        (connected roomA3 roomA4)
        (connected roomA4 roomA5)
        (connected roomA5 roomA6)
        (connected roomA6 roomA7)
        (connected roomA7 roomA8)

        (connected roomA8 roomA7)
        (connected roomA7 roomA6)
        (connected roomA6 roomA5)
        (connected roomA5 roomA4)
        (connected roomA4 roomA3)
        (connected roomA3 roomA2)
        (connected roomA2 roomA1)

        (connected roomB1 roomB2)
        (connected roomB2 roomB3)
        (connected roomB3 roomB4)
        (connected roomB4 roomB5)
        (connected roomB5 roomB6)
        (connected roomB6 roomB7)
        (connected roomB7 roomB8)

        (connected roomB8 roomB7)
        (connected roomB7 roomB6)
        (connected roomB6 roomB5)
        (connected roomB5 roomB4)
        (connected roomB4 roomB3)
        (connected roomB3 roomB2)
        (connected roomB2 roomB1)

        (connected roomC1 roomC2)
        (connected roomC2 roomC3)
        (connected roomC3 roomC4)
        (connected roomC4 roomC5)
        (connected roomC5 roomC6)
        (connected roomC6 roomC7)
        (connected roomC7 roomC8)

        (connected roomC8 roomC7)
        (connected roomC7 roomC6)
        (connected roomC6 roomC5)
        (connected roomC5 roomC4)
        (connected roomC4 roomC3)
        (connected roomC3 roomC2)
        (connected roomC2 roomC1)

        (connected roomD1 roomD2)
        (connected roomD2 roomD3)
        (connected roomD3 roomD4)
        (connected roomD4 roomD5)
        (connected roomD5 roomD6)
        (connected roomD6 roomD7)
        (connected roomD7 roomD8)

        (connected roomD8 roomD7)
        (connected roomD7 roomD6)
        (connected roomD6 roomD5)
        (connected roomD5 roomD4)
        (connected roomD4 roomD3)
        (connected roomD3 roomD2)
        (connected roomD2 roomD1)

        (connected roomA1 roomB1)
        (connected roomB1 roomC1)
        (connected roomC1 roomD1)

        (connected roomD1 roomC1)
        (connected roomC1 roomB1)
        (connected roomB1 roomA1)

        (connected roomA2 roomB2)
        (connected roomB2 roomC2)
        (connected roomC2 roomD2)

        (connected roomD2 roomC2)
        (connected roomC2 roomB2)
        (connected roomB2 roomA2)

        (connected roomA3 roomB3)
        (connected roomB3 roomC3)
        (connected roomC3 roomD3)

        (connected roomD3 roomC3)
        (connected roomC3 roomB3)
        (connected roomB3 roomA3)

        (connected roomA4 roomB4)
        (connected roomB4 roomC4)
        (connected roomC4 roomD4)

        (connected roomD4 roomC4)
        (connected roomC4 roomB4)
        (connected roomB4 roomA4)

        (connected roomA5 roomB5)
        (connected roomB5 roomC5)
        (connected roomC5 roomD5)

        (connected roomD5 roomC5)
        (connected roomC5 roomB5)
        (connected roomB5 roomA5)

        (connected roomA6 roomB6)
        (connected roomB6 roomC6)
        (connected roomC6 roomD6)

        (connected roomD6 roomC6)
        (connected roomC6 roomB6)
        (connected roomB6 roomA6)

        (connected roomA7 roomB7)
        (connected roomB7 roomC7)
        (connected roomC7 roomD7)

        (connected roomD7 roomC7)
        (connected roomC7 roomB7)
        (connected roomB7 roomA7)

        (connected roomA8 roomB8)
        (connected roomB8 roomC8)
        (connected roomC8 roomD8)

        (connected roomD8 roomC8)
        (connected roomC8 roomB8)
        (connected roomB8 roomA8)
    )

    (:goal
        (and
            (at-hero hero1 roomA1)
            (at-hero hero2 roomA1)
        )
    )
)

; plan
1. (move roomb8 roomb7 hero2 curr next)
   deleted: (at-hero hero2 roomb8) (hero-turn hero2 curr)
   added: (at-hero hero2 roomb7) (is-destroyed roomb8) (hero-turn hero2 next)
   goals met: 0 of 2
2. (move-trap roomd4 roomd3 hero1 curr next)
   deleted: (at-hero hero1 roomd4) (hero-turn hero1 curr)
   added: (at-hero hero1 roomd3) (is-destroyed roomd4) (hero-turn hero1 next)
   goals met: 0 of 2
3. (advance-turn curr next)
   deleted: (current-turn curr)
   added: (current-turn next)
   goals met: 0 of 2
4. (disarm-trap roomd3 hero1 next curr)
   deleted: (hero-turn hero1 next)
   added: (is-disarmed roomd3) (hero-turn hero1 curr)
   goals met: 0 of 2
5. (move roomb7 roomc7 hero2 next curr)
   deleted: (at-hero hero2 roomb7) (hero-turn hero2 next)
   added: (at-hero hero2 roomc7) (is-destroyed roomb7) (hero-turn hero2 curr)
   goals met: 0 of 2
6. (advance-turn next curr)
   deleted: (current-turn next)
   added: (current-turn curr)
   goals met: 0 of 2
7. (move roomd3 roomd2 hero1 curr next)
   deleted: (at-hero hero1 roomd3) (hero-turn hero1 curr)
   added: (at-hero hero1 roomd2) (is-destroyed roomd3) (hero-turn hero1 next)
   goals met: 0 of 2
8. (pick-up-key roomc7 hero2 curr next)
   deleted: (holding-nothing hero2) (at-key roomc7) (hero-turn hero2 curr)
   added: (holding-key hero2) (hero-turn hero2 next)
   goals met: 0 of 2
9. (advance-turn curr next)
   deleted: (current-turn curr)
   added: (current-turn next)
   goals met: 0 of 2
10. (move roomd2 roomc2 hero1 next curr)
   deleted: (at-hero hero1 roomd2) (hero-turn hero1 next)
   added: (at-hero hero1 roomc2) (is-destroyed roomd2) (hero-turn hero1 curr)
   goals met: 0 of 2
11. (move roomc7 roomc6 hero2 next curr)
   deleted: (at-hero hero2 roomc7) (hero-turn hero2 next)
   added: (at-hero hero2 roomc6) (is-destroyed roomc7) (hero-turn hero2 curr)
   goals met: 0 of 2
12. (advance-turn next curr)
   deleted: (current-turn next)
   added: (current-turn curr)
   goals met: 0 of 2
13. (move roomc2 roomc1 hero1 curr next)
   deleted: (at-hero hero1 roomc2) (hero-turn hero1 curr)
   added: (at-hero hero1 roomc1) (is-destroyed roomc2) (hero-turn hero1 next)
   goals met: 0 of 2
14. (move-lock roomc6 roomc5 hero2 curr next)
   deleted: (at-hero hero2 roomc6) (hero-turn hero2 curr)
   added: (at-hero hero2 roomc5) (is-destroyed roomc6) (hero-turn hero2 next)
   goals met: 0 of 2
15. (advance-turn curr next)
   deleted: (current-turn curr)
   added: (current-turn next)
   goals met: 0 of 2
16. (move-trap roomc1 roomb1 hero1 next curr)
   deleted: (at-hero hero1 roomc1) (hero-turn hero1 next)
   added: (at-hero hero1 roomb1) (is-destroyed roomc1) (hero-turn hero1 curr)
   goals met: 0 of 2
17. (move roomc5 roomc4 hero2 next curr)
   deleted: (at-hero hero2 roomc5) (hero-turn hero2 next)
   added: (at-hero hero2 roomc4) (is-destroyed roomc5) (hero-turn hero2 curr)
   goals met: 0 of 2
18. (advance-turn next curr)
   deleted: (current-turn next)
   added: (current-turn curr)
   goals met: 0 of 2
19. (disarm-trap roomb1 hero1 curr next)
   deleted: (hero-turn hero1 curr)
   added: (is-disarmed roomb1) (hero-turn hero1 next)
   goals met: 0 of 2
20. (move roomc4 roomb4 hero2 curr next)
   deleted: (at-hero hero2 roomc4) (hero-turn hero2 curr)
   added: (at-hero hero2 roomb4) (is-destroyed roomc4) (hero-turn hero2 next)
   goals met: 0 of 2
21. (advance-turn curr next)
   deleted: (current-turn curr)
   added: (current-turn next)
   goals met: 0 of 2
22. (drop-key roomb4 hero2 next curr)
   deleted: (holding-key hero2) (hero-turn hero2 next)
   added: (holding-nothing hero2) (at-key roomb4) (hero-turn hero2 curr)
   goals met: 0 of 2
23. (disarm-trap roomb1 hero1 next curr)
   deleted: (hero-turn hero1 next)
   added: (hero-turn hero1 curr)
   goals met: 0 of 2
24. (advance-turn next curr)
   deleted: (current-turn next)
   added: (current-turn curr)
   goals met: 0 of 2
25. (pick-up-sword roomb4 hero2 curr next)
   deleted: (holding-nothing hero2) (at-sword roomb4) (hero-turn hero2 curr)
   added: (holding-sword hero2) (hero-turn hero2 next)
   goals met: 0 of 2
26. (disarm-trap roomb1 hero1 curr next)
   deleted: (hero-turn hero1 curr)
   added: (hero-turn hero1 next)
   goals met: 0 of 2
27. (advance-turn curr next)
   deleted: (current-turn curr)
   added: (current-turn next)
   goals met: 0 of 2
28. (move roomb4 roomb3 hero2 next curr)
   deleted: (at-hero hero2 roomb4) (hero-turn hero2 next)
   added: (at-hero hero2 roomb3) (is-destroyed roomb4) (hero-turn hero2 curr)
   goals met: 0 of 2
29. (disarm-trap roomb1 hero1 next curr)
   deleted: (hero-turn hero1 next)
   added: (hero-turn hero1 curr)
   goals met: 0 of 2
30. (advance-turn next curr)
   deleted: (current-turn next)
   added: (current-turn curr)
   goals met: 0 of 2
31. (move-monster roomb3 rooma3 hero2 curr next)
   deleted: (at-hero hero2 roomb3) (hero-turn hero2 curr)
   added: (at-hero hero2 rooma3) (is-destroyed roomb3) (hero-turn hero2 next)
   goals met: 0 of 2
32. (disarm-trap roomb1 hero1 curr next)
   deleted: (hero-turn hero1 curr)
   added: (hero-turn hero1 next)
   goals met: 0 of 2
33. (advance-turn curr next)
   deleted: (current-turn curr)
   added: (current-turn next)
   goals met: 0 of 2
34. (move rooma3 rooma2 hero2 next curr)
   deleted: (at-hero hero2 rooma3) (hero-turn hero2 next)
   added: (at-hero hero2 rooma2) (is-destroyed rooma3) (hero-turn hero2 curr)
   goals met: 0 of 2
35. (move roomb1 rooma1 hero1 next curr)
   deleted: (at-hero hero1 roomb1) (hero-turn hero1 next)
   added: (at-hero hero1 rooma1) (is-destroyed roomb1) (hero-turn hero1 curr)
   goals met: 1 of 2
36. (advance-turn next curr)
   deleted: (current-turn next)
   added: (current-turn curr)
   goals met: 1 of 2
37. (move rooma2 rooma1 hero2 curr next)
   deleted: (at-hero hero2 rooma2) (hero-turn hero2 curr)
   added: (at-hero hero2 rooma1) (is-destroyed rooma2) (hero-turn hero2 next)
   goals met: 2 of 2
